app/Controllers/EventController.php

SELECT *
FROM `events`
---
    public function displayTable_event()
    {
        $event = new eventmodel();

        $data['events'] = $event->findAll(); // Fetch all records from 'events' table

INSERT INTO `events` (`event_name`, `event_disc`, `image`, `event_date`) VALUES ('Running', 'amazing event', 'event1.jpg', '2023-12-20')
---
    public function saveEvent()
    {
        $eventsModel = new eventModel();

        if ($this->request->getMethod() === 'post') {
            $image = $this->request->getFile('image');


            $fileName = $image->getName();

            $data = [
                'event_name' => $this->request->getVar('event_name'),
                'event_disc' => $this->request->getVar('event_disc'),
                'image' => $fileName,
                'event_date' => $this->request->getVar('event_date'),

            ];

            $eventsModel->insert($data);