app/Controllers/MailController.php


            $mail->send();
            $reclam = new ReclamationModel();
            $reclam
                ->where('NumReclamation', $id)
                ->set(['Status' => "Decline"])
                ->update();
---
UPDATE `reclamation` SET `Status` = 'Decline'
WHERE `NumReclamation` = '7'