app/Controllers/ReclamationController.php

    public function listreclamation()
    {
        $data = [];
        $Reclam = new ReclamationModel();
        $session = session()->get('PseudoNom');
        if ($session == "admin") {
            $data['data'] = $Reclam->findAll();
        } else {
            $data['data'] = $Reclam->where('PseudoNom', $session)->findAll();
---
SELECT *
FROM `reclamation`
WHERE `PseudoNom` = 'User'