app/Models/eventmodel.php

SELECT *
FROM `events`
---
        public function getAllEvents()
    {
        // Fetch events from the database (example)
        return $this->db->table('events')->get()->getResultArray();